"""
Выведите на экран справку о модуле texttable и его содержимое.
Самостоятельно ознакомьтесь с возможностями данного модуля.
"""
import texttable

help(texttable)
print('+'*100)
print(dir(texttable))